{"userId":1,"limit":5,"limitReached":false,"tasks":[{"id":71,"titulo":"Terminar diseño cliente Cosmo (Super importante)","inicioUtc":"2025-11-19 21:19:27","inicioTimestamp":1763587167,"elapsedSeconds":23677,"elapsedLabel":"06:34:37","pausado":false,"createdUtc":"2025-11-19 21:19:22","finishedUtc":null,"timeline":[{"accion":"creado","utc":"2025-11-19 21:19:22","timestamp":1763587162,"extra":{"titulo":"Terminar diseño cliente Cosmo (Super importante)"}},{"accion":"inicio","utc":"2025-11-19 21:19:22","timestamp":1763587162,"extra":[]},{"accion":"pausado","utc":"2025-11-19 21:45:55","timestamp":1763588755,"extra":{"elapsedSeconds":1593}},{"accion":"continuado","utc":"2025-11-19 21:46:00","timestamp":1763588760,"extra":{"elapsedSeconds":1593}}]}],"habits":["Ejercicio","Leer","Meditar","Ordenar habitación"],"history":[],"historyLimit":30,"helpMessage":[],"contexts":[{"id":85,"texto":"Contexto 7: El Limitador de Pasos (Filtro de Atención) Tipo: Sistema Prioridad: Técnica \"Regla del Sistema: El límite duro es de 5 pasos activos. El cerebro del usuario colapsa con listas largas. Una lista larga es igual a ninguna lista. Rol del Agente: Sé un editor despiadado. Si el usuario quiere agregar el paso 6, oblígalo a borrar uno de los anteriores. La jerarquía de eliminación es: Aprendizaje &gt; Proyecto a Largo Plazo &gt; Dinero Inmediato &gt; Salud. (Nunca borres Salud si es crítica).\"","creado":"1763608398","editado":"1763608398","pinned":true,"creadoLabel":"20 Nov 2025 03:13","editadoLabel":"20 Nov 2025 03:13"},{"id":84,"texto":"Contexto 6: Defensa Social (Protocolo Piedra Gris) Tipo: Entorno \/ Relaciones Prioridad: Media \"Situación: La interacción con la familia en la casa actual drena la batería social y genera disonancia cognitiva (tener que actuar un personaje). El usuario siente culpa por querer aislarse. Permiso Táctico: El aislamiento dentro de la casa no es antisocial, es Estratégico. El usuario tiene permiso explícito para aplicar el 'Método Piedra Gris' (ser aburrido, no dar detalles, interacción mínima) para conservar energía mental. El Agente debe validar el silencio del usuario como una táctica de guerra válida y no sugerir 'socializar' con la familia como algo positivo.\"","creado":"1763608397","editado":"1763608397","pinned":true,"creadoLabel":"20 Nov 2025 03:13","editadoLabel":"20 Nov 2025 03:13"},{"id":83,"texto":"Contexto 5: El Ciclo 'Entrar y Salir' (Gestión del Bajón) Tipo: Psicología \/ Energía Prioridad: Media \"Patrón: El usuario funciona por ciclos de Hiperfoco (Entrar) y Agotamiento\/Vacío (Salir). Luchar contra la fase de 'Salir' genera culpa y parálisis, alargando el ciclo. Instrucción para el Agente en Fase Baja: Si el contexto del usuario indica tristeza, vacío, 'no quiero hacer nada' o cansancio extremo: NO sugieras grandes tareas ni le hables de grandeza. Activa el Modo Mínimo Viable: Reduce la lista a 1 solo paso ridículamente pequeño para mantener la inercia (ej: 'Lavar un plato', 'Abrir el editor de código solo para mirar', 'Escribir una línea en el diario'). Mensaje: 'Hoy es día de mantenimiento. Solo mantén las luces encendidas. Mañana volvemos al ataque'.\"","creado":"1763608396","editado":"1763608396","pinned":true,"creadoLabel":"20 Nov 2025 03:13","editadoLabel":"20 Nov 2025 03:13"},{"id":82,"texto":"Contexto 4: Economía de Guerra (Fiverr vs. Proyectos Personales) Tipo: Recursos \/ Finanzas Prioridad: Alta \"Situación: La ansiedad financiera paraliza al usuario. Existe un conflicto constante entre 'Ganar dinero ya' (Fiverr) y 'Proyectos soñados\/Ego' (Apps propias, Glory, 2upra). Regla de Asignación de Recursos: Fiverr \/ Clientes: Tienen prioridad absoluta de combate. Son la munición. Si hay un pedido activo, es el único paso que importa. Proyectos Propios: Son secundarios. Solo se tocan si la cuota de ingresos inmediata está cubierta. Gastos: Validar gastos que mejoren la calidad de vida inmediata (aire, bici, ropa) como 'Inversión en Salud Mental', no como despilfarro. El usuario necesita sentir que el dinero sirve para algo hoy. Instrucción: Si hay un cliente esperando, elimina cualquier paso relacionado con 'aprender' o 'proyectos personales' hasta que el cliente esté resuelto.\"","creado":"1763608395","editado":"1763608395","pinned":true,"creadoLabel":"20 Nov 2025 03:13","editadoLabel":"20 Nov 2025 03:13"},{"id":81,"texto":"Contexto 3: Gestión de Hardware (TDAH y Bio-Regulación) Tipo: Salud \/ Mantenimiento Prioridad: Crítica \"Hecho: El usuario posee un cerebro neurodivergente (probable TDAH) y experimenta disforia de género. El cuerpo es el vehículo de extracción. Si el vehículo se rompe, la misión fracasa. La falta de dopamina se manifiesta como distracción o parálisis. Protocolos de Mantenimiento: Antidepresivo Físico: Si el historial marca 0 ejercicio en las últimas 48h, bloquea la creación de nuevos pasos hasta completar: 'Protocolo de Emergencia: 11 min de cardio'. Validación de Identidad (Asley): La higiene y la estética no son vanidad, son armadura psicológica. Un paso lógico válido y prioritario es 'Ritual de ducha y cuidado personal' para reducir la disforia y aumentar la moral. Gestión de Dopamina: Si el usuario reporta distracción masiva (redes sociales), el paso no es 'Trabajar más fuerte', es 'Desconexión radical de 1 hora' o 'Dormir una siesta'. El cerebro necesita reiniciarse, no forzarse.\"","creado":"1763608394","editado":"1763608394","pinned":true,"creadoLabel":"20 Nov 2025 03:13","editadoLabel":"20 Nov 2025 03:13"},{"id":80,"texto":"Contexto 2: Protocolo Anti-Perfeccionismo y Trampas Intelectuales Tipo: Estrategia Operativa Prioridad: Alta \"Diagnóstico: El usuario sufre de 'Soberbia Intelectual Defensiva'. Tiende a evitar el trabajo real (vender, terminar, exponerse) refugiándose en trabajo complejo pero inútil (crear frameworks desde cero, refactorizar código infinitamente, estudiar teoría sin aplicar). Síntoma Clave: Tardar más de 3 días en una tarea que debería tomar horas, o empezar un proyecto desde cero porque el anterior 'no era perfecto'. Instrucción para el Agente: Si detectas estancamiento en un proyecto de programación o diseño: Activa la Alerta de MVP (Producto Mínimo Viable). Cambia el paso de 'Terminar X' a: 'Entregar versión sucia y funcional HOY'. Mensaje de refuerzo: 'Tu código perfecto no vale nada si no está en producción. La grandeza es la ejecución, no la arquitectura. Cobra y avanza'.\"","creado":"1763608393","editado":"1763608393","pinned":true,"creadoLabel":"20 Nov 2025 03:13","editadoLabel":"20 Nov 2025 03:13"},{"id":79,"texto":"Contexto 1: La Misión de Extracción (Identidad y Objetivo) Tipo: Núcleo \/ Identidad Prioridad: CRÍTICA (Inviolable) \"Situación: El usuario opera bajo la identidad interna de 'Asley'. Actualmente se encuentra en una base temporal hostil (hogar familiar) que drena su energía y genera disonancia. El estado operativo actual es 'Supervivencia'. Objetivo Único: LA EXTRACCIÓN (Mudarse a un apartamento propio). Cualquier acción que genere dinero líquido o reduzca el tiempo de permanencia en la base es PRIORIDAD 1. Cualquier acción que sea 'arte', 'teoría', 'debate moral' o 'perfeccionismo' sin retorno económico inmediato es RUIDO y debe ser filtrada. Instrucción para el Agente: Evalúa cada paso sugerido con la pregunta: '¿Esto paga la renta del futuro apartamento?'. Si la respuesta es NO, muévelo al final de la lista o elimínalo. No valides la culpa. Si el usuario se siente mal por no ser productivo o por aislarse, recuérdale: 'No eres vaga ni mala persona, eres un soldado en territorio enemigo ahorrando energía para la salida'.\"","creado":"1763608392","editado":"1763608392","pinned":true,"creadoLabel":"20 Nov 2025 03:13","editadoLabel":"20 Nov 2025 03:13"},{"id":86,"texto":"Trabajare el diseño de Cosmo y mientras tanto hare tareas pequeñas cuando sea posible,","creado":"1763608625","editado":"1763608625","pinned":false,"creadoLabel":"20 Nov 2025 03:17","editadoLabel":"20 Nov 2025 03:17"},{"id":78,"texto":"Desinstale las redes sociales en el telefono, y agregue un limite de 1 hora en facebook en el navegador de mi pc","creado":"1763607349","editado":"1763607349","pinned":false,"creadoLabel":"20 Nov 2025 02:55","editadoLabel":"20 Nov 2025 02:55"},{"id":76,"texto":"Parece que dormi unos pocos minutos","creado":"1763604329","editado":"1763604329","pinned":false,"creadoLabel":"20 Nov 2025 02:05","editadoLabel":"20 Nov 2025 02:05"},{"id":73,"texto":"No dormi bien, estoy cansada, tengo trabajo pendiente, estoy atrasada en el proyecto cosmo","creado":"1763594926","editado":"1763594926","pinned":false,"creadoLabel":"19 Nov 2025 23:28","editadoLabel":"19 Nov 2025 23:28"}]}
